ozon_wh_id = {'OZ.ОктКГnew': (23138678478000, "Октябрьский новый крупногабаритный"),
              'OZ.ОснКурьер': (23990969841000, "Основной склад - Курьеры"),'OZ.ОснКурьердо25': (23997026419000, "Осн склад Курьеры некрупный груз до 25кг"),
                'OZ.RFBSнашсклДЛ': (1020000039316000, "RFBS наш склад Деловые Линии"),'OZ.НашадостМиМО': (1020000068495000, "НАША ДОСТАВКА Москва и МО"),
               'OZ.RFBSНашсклСДЭК' : (1020000075732000, "RFBS наш склад СДЭК"), "OZ.ДостКГ": (23012928587000, "Октябрьский крупногабарит")}

warehouses_id = {21405051875000: "Октябрьский малый", 23138678478000: "Октябрьский новый крупногабаритный",
                 23990969841000: "Основной склад - Курьеры", 23997026419000: "Осн склад Курьеры некрупный груз до 25кг",
               1020000039316000: "RFBS наш склад Деловые Линии", 1020000068495000: "НАША ДОСТАВКА Москва и МО", 1020000075732000: "RFBS наш склад СДЭК"}
